In [1]:
import pandas as pd
import mysql.connector
from mysql.connector import errorcode

In [2]:
try:
    conn=mysql.connector.connect(user='k1895908',password='H5gCl41N',host='mysql2.nms.kcl.ac.uk',database='k1895908_db6',port='33306')
    
    cursor=conn.cursor()
    cursor.execute(""" SELECT fname
    FROM student
    WHERE LOCATE("a", fname) = 0
    LIMIT 5;
    
    """)
    col_names=cursor.column_names
    
    rows=cursor.fetchall()
    result=pd.DataFrame(list(rows),columns=col_names)
    
except mysql.connector.Error as e:
    print(e)  
finally:
    cursor.close()
    conn.close()

print("shape: ",result.shape)
result

('shape: ', (5, 1))

     fname
0   Linnie
1  Britney
2     Rene
3   Wilson
4   Connie

In [7]:
try:
    conn=mysql.connector.connect(user='k1895908',password='H5gCl41N',host='mysql2.nms.kcl.ac.uk',database='k1895908_db6',port='33306')
    
    cursor=conn.cursor()
    cursor.execute(""" SELECT fname
    FROM student

    LIMIT 5;
    
    """)
    col_names=cursor.column_names
    
    rows=cursor.fetchall()
    result=pd.DataFrame(list(rows),columns=col_names)
    
except mysql.connector.Error as e:
    print(e)  
finally:
    cursor.close()
    conn.close()

print("shape: ",result.shape)
result

('shape: ', (5, 1))

     fname
0     Alda
1  Racheal
2     Lisa
3   Linnie
4  Sebrina

In [8]:
try:
    conn=mysql.connector.connect(user='k1895908',password='H5gCl41N',host='mysql2.nms.kcl.ac.uk',database='k1895908_db6',port='33306')
    
    cursor=conn.cursor()
    cursor.execute(""" SELECT courseID from takesCourse WHERE  (SELECT max(a.c) FROM (SELECT courseID,COUNT(*) as c FROM takesCourse GROUP BY 1) AS a) As cid
    
    
    """)
    col_names=cursor.column_names
    
    rows=cursor.fetchall()
    result=pd.DataFrame(list(rows),columns=col_names)
    
except mysql.connector.Error as e:
    print(e)  
finally:
    cursor.close()
    conn.close()

print("shape: ",result.shape)
result

('shape: ', (1, 1))

   max(a.c)
0         7

List the name and the number of students of the most taken course